function generateGreeting() {
  const name = document.getElementById("name").value;

  const greetings = [
    `كل عام وأنتم بخير بمناسبة عيد الفطر، ${name}! شكرًا لك على مساهمتك في مجتمع تطوير البرمجيات. نتمنى لك عيدًا سعيدًا ومليئًا بالأفراح والمسرات!`,
    `تقبل الله منا ومنكم صالح الأعمال، ${name}، وكل عام وأنتم بخير بمناسبة عيد الفطر! نتمنى لك يومًا مليئًا بالسعادة والاحتفالات.`,
    `نتمنى لك عيدًا سعيدًا ومليئًا بالأفراح، ${name}! ونشكرك على مساهمتك القيّمة في مجال تطوير البرمجيات.`,
    `كل عام وأنت بخير وعيد مبارك، ${name}! نتمنى لك أوقاتًا مليئة بالفرح والمسرات مع أحبائك.`,
    `عيد فطر سعيد، ${name}! نتمنى لك عيدًا مليئًا بالسعادة والهناء وأن يحقق الله لك ما تتمناه.`,
        `عيد فطر سعيد، ${name} زدت عيدنا بهجة وسرور ونتمنى لك ان ترافقك السعادة دائما :).`,
            `عيد فطر سعيد، ${name}أن تغمر ايامك البهجة وتتوالى عليك المسرات وتصبح ايامك كلها عيد  `,
            `عيد فطر مبارك ${name}تقبل اللّه طاعتك وأتمّ بالعيد بهجتك
            عيدك مُبارك وكل عام وأنت بخِير 🤍.  `,
            `كل عام وأنت بخير وعيد مبارك، ${name}!‏كل عام وأنتِ وحسك الباهي يزيّد 
            ‏عسى عيدك سعيد و أيامك هنية ♥️`,
            `كل عام وأنت بخير وعيد مبارك، ${name}! نتمنى لك أوقاتًا مليئة بالفرح والمسرات مع أحبائك.`,



  ];

  const randomIndex = Math.floor(Math.random() * greetings.length);
  const greeting = greetings[randomIndex];

  const greetingDiv = document.getElementById("greeting");
  greetingDiv.innerHTML = greeting;
}
